{
  "backend/main.mo": "Main Motoko actor for the dental clinic backend, defining data types and CRUD operations for appointments, reviews, doctors, services, before/after gallery, user profiles, and clinic status, with authorization via access control mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin tooth-logo trigger, admin dashboard consolidation, frictionless booking dialog) to their affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, serving as a quick reference for the purpose and key details of every component, page, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, accent, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'XYZ Dental Clinic' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with all page routes (home, service detail pages, admin pages) and wraps the app in QueryClientProvider and ThemeProvider with a shared Header/Footer layout.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that redirects unauthenticated or non-admin users to the access-denied page, showing a spinner while authentication and admin status are being resolved.",
  "frontend/src/components/BackgroundParticles.tsx": "Decorative fixed-position background component that renders 18 randomly positioned, animated SVG particles (tooth, plus, sparkle, circle shapes) with low opacity for a subtle dental theme effect.",
  "frontend/src/components/BeforeAfterSlider.tsx": "A draggable before/after image comparison slider component that supports mouse and touch events, displaying dental treatment pairs (orthodontics, whitening, smile makeover) with scroll reveal animations.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog form for booking dental appointments, collecting patient name, phone, service type, and preferred date, then submitting via a React Query mutation with validation and success state.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a dismissible alert banner at the top of the page when the clinic status is 'closed' or 'emergency', fetched via a React Query hook.",
  "frontend/src/components/ContactSection.tsx": "A contact section displaying clinic phone, WhatsApp link, address, and hours alongside an embedded Google Maps iframe, with scroll-reveal animations.",
  "frontend/src/components/CustomCursor.tsx": "A stub component that disables any custom cursor implementation and renders nothing, deferring to the native OS cursor.",
  "frontend/src/components/DoctorProfile.tsx": "Renders a two-column doctor profile section with an image, bio, stats (experience, patients, success rate), and specialty tags for Dr. Priya Sharma, with scroll-reveal animations.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders four floating dental icon images with CSS bob animations and scroll-based parallax offsets, positioned absolutely as non-interactive decorative elements.",
  "frontend/src/components/Footer.tsx": "A site footer with brand info, service links, contact details, a caffeine.ai attribution link, and a hidden tooth-logo button that opens an admin login modal.",
  "frontend/src/components/Header.tsx": "Sticky site header with desktop/mobile navigation links, a 'Book Appointment' button that opens BookAppointmentDialog, and a hamburger menu for mobile viewports.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, scroll-reveal animation, headline text, and buttons to open the booking dialog or scroll to services.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "A dialog-based admin login form that validates hardcoded credentials and navigates to the admin dashboard on success.",
  "frontend/src/components/HiddenAdminTrigger.tsx": "An invisible fixed element in the bottom-right corner that opens the admin login modal on double-click or double-tap.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/ScrollProgressBar.tsx": "A fixed 3px progress bar at the top of the viewport that fills based on the user's scroll position on the page.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of premium clickable service cards (with hover animations and scroll-reveal) and a row of standard service cards for the dental clinic.",
  "frontend/src/components/TestimonialCarousel.tsx": "An auto-scrolling infinite carousel of patient testimonials, using backend-approved reviews when available and falling back to static testimonials.",
  "frontend/src/components/TypewriterText.tsx": "A component that animates text with a typewriter effect once the element becomes visible via scroll-reveal, with configurable speed and HTML tag.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, then saves it via a mutation hook.",
  "frontend/src/components/ZoomInImage.tsx": "Image component that animates from scaled-down and transparent to full size when scrolled into view using the useScrollReveal hook.",
  "frontend/src/context/CursorContext.tsx": "React context that tracks and exposes a cursor icon state ('default' or 'dental') with a setter for global cursor customization.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGlassmorphismReveal.ts": "Hook that uses IntersectionObserver to set a visibility flag when an element enters the viewport, intended for glassmorphism reveal animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication on ICP, managing AuthClient lifecycle, login/logout, and exposing identity and status via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend interactions including appointments, clinic status, services, reviews, and user profiles.",
  "frontend/src/hooks/useScrollReveal.ts": "Generic hook that uses IntersectionObserver to toggle a visibility boolean when a referenced element scrolls into view, triggering once per element.",
  "frontend/src/hooks/useTextScramble.ts": "Hook that animates text with a randomized character scramble effect when the element enters the viewport, resolving to the target text over ~1 second.",
  "frontend/src/index.css": "Global stylesheet defining the OKLCH design token system, animated mesh gradient background, glassmorphism utilities, typography, and scroll reveal transition classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDenied.tsx": "Full-page access denied screen with a shield icon and a button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments with patient details, status badges, and buttons to confirm or cancel pending appointments using the updateAppointmentStatus mutation.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, upload progress tracking, and a list of existing pairs fetched from the backend.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page with a form to submit patient reviews (name, text, star rating) that are saved in a pending state awaiting approval before public display.",
  "frontend/src/pages/admin/Dashboard.tsx": "Main admin dashboard showing clinic status controls (open/closed/emergency), a tabbed appointments table with status badges, and navigation links to other admin sections.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors (name and specialty) and listing all existing doctors, using React Query hooks and toast notifications.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin page for moderating pending patient reviews, allowing admins to approve or delete each review with star ratings and optional photos.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin page for editing a fixed list of premium dental services, supporting display name, description, and featured photo upload with progress tracking.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the Dental Implants service, featuring a hero section, benefits grid, and step-by-step process, all with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/Home.tsx": "Main home page that composes all major sections (hero, services, doctor profile, before/after slider, testimonials, contact) along with a clinic status banner and floating decorative elements.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service, showcasing benefits, a before/after slider, and a CTA section with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for Laser Dentistry, highlighting benefits and specific treatments with an animated laser-beam hero decoration, scroll-reveal sections, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for Pediatric Dentistry, presenting child-friendly features and an early-habits section with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Generic service detail page that fetches service data by route param, displays a featured photo, description, and feature list, with a booking dialog and loading spinner.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Detail page for the Smile Makeover service, featuring a hero section, list of included treatments, a before/after slider, and a booking CTA with scroll-reveal animations throughout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based semantic colors, teal/royal-blue palettes, custom fonts, glow shadows, and mesh-gradient/float animations.",
  "project_state.json": "Tracks the overall project state (version 15) for a premium dental clinic website, documenting features, architectural notes, design decisions, known issues, and image requirements including GSAP animations, glassmorphism, admin panel, and appointment booking."
}