{
  "backend/main.mo": "Main Motoko actor for a dental clinic app defining types (Appointment, Review, Doctor, Service, etc.) and CRUD operations with role-based access control via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: replacing BookAppointmentDialog with a frictionless 4-field booking form and removing auth gates from all public-facing booking buttons.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component or page's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA with a root div and module script entry point, titled 'XYZ Dental Clinic'.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router with all public and admin routes, QueryClient, ThemeProvider, CursorContextProvider, and shared Layout/AdminLayout wrappers.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that redirects unauthenticated or non-admin users to the access-denied page, showing a spinner while auth state is loading.",
  "frontend/src/components/BackgroundParticles.tsx": "Decorative fixed-position background component that renders 18 randomly positioned animated SVG particles (tooth, plus, sparkle, circle shapes) with CSS float animations.",
  "frontend/src/components/BeforeAfterSlider.tsx": "Renders an interactive before/after image comparison slider with drag support, fetching pairs from the backend or falling back to static/prop-provided pairs.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog form that collects patient name, phone, date, and service type to book an appointment, showing a success state after submission.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top-of-page alert banner when the clinic status is 'closed' or 'emergency', hiding itself when the clinic is open.",
  "frontend/src/components/ContactSection.tsx": "Static contact section displaying phone, address, hours, a WhatsApp button, and an embedded Google Maps iframe.",
  "frontend/src/components/CustomCursor.tsx": "Replaces the default cursor with a smooth, eased custom cursor that expands on interactive elements and shows a dental icon when a special cursor mode is active.",
  "frontend/src/components/DoctorProfile.tsx": "Static section displaying the doctor's photo, credentials, bio, stats, and specialty tags in a two-column card layout.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders four floating dental icon images with CSS bob animations and scroll-based parallax offsets as a decorative background layer.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick links, and services list. Includes a hidden admin login modal triggered by triple-clicking the copyright text.",
  "frontend/src/components/Header.tsx": "Renders the fixed top navigation header with desktop/mobile nav links and a Book Appointment button. Includes a hidden admin login modal triggered by a 3-second long press on the logo.",
  "frontend/src/components/HeroSection.tsx": "Displays the hero section with a parallax background image, headline text, and a Book Appointment button that opens the booking dialog.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "A dialog modal for admin login with hardcoded credentials that navigates to the admin dashboard on success. Triggered secretly from the header or footer.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout using a custom hook, showing loading state during authentication.",
  "frontend/src/components/ScrollProgressBar.tsx": "A fixed top progress bar that visually indicates scroll depth on the page using a teal-to-blue gradient.",
  "frontend/src/components/ServicesGrid.tsx": "Renders a grid of dental service cards fetched from a query hook, with special interactive cards for implants (3D rotation on hover) and Invisalign (before/after slider).",
  "frontend/src/components/TestimonialCarousel.tsx": "Auto-scrolling carousel that displays patient reviews fetched from the backend, falling back to hardcoded reviews if none are available, with star ratings and pause-on-hover behavior.",
  "frontend/src/components/TypewriterText.tsx": "A scroll-triggered typewriter component that animates text character-by-character when the element enters the viewport, supporting configurable speed and HTML tag.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to enter their name and create a profile, shown only when the user is logged in but has no existing profile.",
  "frontend/src/components/ZoomInImage.tsx": "A scroll-reveal image component that scales and fades in an image when it enters the viewport using an IntersectionObserver-based hook.",
  "frontend/src/context/CursorContext.tsx": "React context that tracks and exposes a global cursor icon state ('default' or 'dental') for use across the application.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an ICP backend actor using the current Internet Identity, initializing admin access if a token is present and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Computer Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity state and status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping all backend actor calls for appointments, clinic status, reviews, doctor availability, gallery blobs, and user profiles.",
  "frontend/src/hooks/useScrollReveal.ts": "Hook that uses IntersectionObserver to set an `isVisible` flag when a referenced element scrolls into view, triggering once and then unobserving.",
  "frontend/src/hooks/useTextScramble.ts": "Hook that animates a text scramble effect on an element when it enters the viewport, progressively resolving random characters to the target string over ~1 second.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Playfair Display fonts, sets up Tailwind, defines CSS custom properties for light/dark themes using oklch colors, and declares animations for mesh background, floating elements, particles, and scroll reveal effects.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AccessDenied.tsx": "Simple access-denied page displaying a shield alert icon, an error message, and a button to navigate back to the home route.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments fetched via `useGetAllAppointments`, supports filtering by status, and allows inline status updates with toast notifications.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, tracking upload progress, and persisting pairs via `useAddBeforeAfterPair`, while also listing existing pairs.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page for submitting new patient reviews with name, text, and star rating fields. Submitted reviews are saved in a pending state requiring approval before public display.",
  "frontend/src/pages/admin/Dashboard.tsx": "Main admin dashboard providing clinic open/closed and emergency status toggles, a recent appointments table, and navigation cards linking to all admin sub-pages.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors with name and specialty fields, and displaying the current list of doctors fetched from the backend.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin moderation page that lists pending patient reviews and allows admins to approve or delete each review with toast feedback.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin page for editing a predefined list of dental services, allowing updates to display name, description, and featured photo with upload progress tracking.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the dental implants service, showing a hero section with typewriter title and zoom image, a benefits grid, and a step-by-step implant process, with data fetched via useGetService and a booking dialog.",
  "frontend/src/pages/Home.tsx": "Main landing page that composes all major sections (hero, services, before/after, doctor, testimonials, contact) and conditionally shows a modal when the clinic status is closed.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service featuring a hero with typewriter text and zoom image, a benefits list, a before/after slider, and a step-by-step process, with service data loaded via useGetService.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for laser dentistry featuring an animated laser beam decoration, a hero section, benefits grid, and treatment steps, with service data fetched via useGetService and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for the Pediatric Dentistry service, fetching service data via `useGetService` and displaying a hero section, benefits list, and process steps with animated bubbles and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Generic service detail page that looks up a hardcoded map of dental services (root canal, braces, whitening, implants) by route param and renders the service's benefits, process steps, and a booking dialog.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Detail page for the Smile Makeover service, fetching service data via `useGetService` and rendering a hero section, benefits grid, before/after slider gallery, and a booking dialog.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (royal-blue, teal, CSS-variable-based design tokens), fonts (Inter, Playfair Display), border radii, and custom animations; includes the tailwindcss-animate and @tailwindcss/typography plugins.",
  "project_state.json": "Tracks the overall project state (version 11) for a premium dental clinic website, documenting architectural decisions, existing features, known issues, and design guidelines such as the hidden admin panel trigger, zero-friction booking flow, and animation/glassmorphism approach."
}