{
  "backend/main.mo": "Main backend actor defining types (Appointment, Review, Doctor, UserProfile) and implementing CRUD operations for appointments, reviews, doctors, user profiles, and clinic status management with role-based access control using authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including micro-interactions, hero section, before/after slider, services grid, doctor profiles, testimonials, and admin functionality with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing routing, React Query hooks, UI components (header, footer, hero, sliders, grids), admin pages, and authentication guards with notes on CSS animations replacing framer-motion.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for background, foreground, primary, secondary, muted, accent, destructive, borders, and sidebar components using oklch color space.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'XYZ Dental Clinic', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, service details, access denied, and admin pages (dashboard, appointments, content, doctors), wrapped in ThemeProvider with Layout including Header, Footer, UserProfileSetup, and Toaster.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status using Internet Identity and backend queries, redirecting unauthorized users to access-denied page with loading spinner during verification.",
  "frontend/src/components/BeforeAfterSlider.tsx": "Interactive before/after image comparison component with draggable slider handle supporting mouse and touch events, using CSS clip-path for image reveal with smooth transitions and labeled overlays.",
  "frontend/src/components/BookAppointmentDialog.tsx": "Dialog component for booking appointments with form fields for patient name, contact info, date picker, and service type selection. Handles authentication check, form validation, and appointment creation via mutation hook.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays an alert banner at the top of the page when clinic status is 'emergency' or 'closed', fetching status from backend. Shows appropriate icon and message based on status type.",
  "frontend/src/components/ContactSection.tsx": "Contact information section displaying phone, location, hours, and WhatsApp button alongside an embedded Google Maps iframe. Uses Lucide icons and responsive grid layout.",
  "frontend/src/components/DoctorProfile.tsx": "Profile section showcasing Dr. Sarah Johnson with image, credentials, education, specializations, and awards. Uses two-column responsive layout with animated slide-in effects.",
  "frontend/src/components/Footer.tsx": "Site footer with four-column grid containing brand info, quick links, services list, and social media icons. Includes copyright notice and Caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile menu, and login button. Includes responsive mobile menu toggle with slide-down navigation.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with parallax background image, gradient overlay, headline text, and call-to-action button that opens the appointment booking dialog. Features animated entrance effects.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity. Handles loading states, errors, and clears query cache on logout.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of four dental services (root canal, braces, whitening, implants) as clickable cards that navigate to individual service detail pages. Each card includes an icon, title, description, and hover animations.",
  "frontend/src/components/TestimonialCarousel.tsx": "Auto-rotating carousel component that displays patient reviews with star ratings, testimonial text, and reviewer names. Includes manual navigation controls and transition animations.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Appears automatically after login and cannot be dismissed until completed.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state changes and initializing access control with admin token. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Configures AuthClient with custom options including derivation origin.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, clinic status, reviews, appointments, doctors, and availability. Provides both query and mutation hooks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, defining color schemes including custom royal-blue and teal colors for the dental clinic brand. Includes custom animations for fade-in and slide-up effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/AccessDenied.tsx": "Displays an access denied error page with a shield icon, message, and button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page for viewing and managing all patient appointments with filtering by status and ability to update appointment statuses (pending, confirmed, completed, cancelled).",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin interface for adding patient reviews and testimonials with fields for reviewer name, review text, and star rating.",
  "frontend/src/pages/admin/Dashboard.tsx": "Main admin dashboard providing navigation to appointments, content manager, and doctor scheduler, plus controls for setting clinic operational status (open/closed).",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for managing doctor profiles, allowing addition of new doctors with name and specialty, and displaying a list of current doctors.",
  "frontend/src/pages/Home.tsx": "Main landing page that composes multiple sections including clinic status banner, hero, before/after sliders, services grid, doctor profile, testimonials, and contact form.",
  "frontend/src/pages/ServiceDetail.tsx": "Dynamic service detail page that displays comprehensive information about dental services (root canal, braces, whitening, implants) including benefits, process steps, and booking functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette using OKLCH color space (royal blue, teal, sidebar colors), container settings, border radius variables, and animation keyframes for accordions.",
  "project_state.json": "Project metadata defining a premium dental clinic website with modern design, smooth animations, before/after sliders, admin panel, and detailed image requirements for hero sections, service icons, and treatment photos."
}