{
  "backend/main.mo": "Main Motoko actor for a dental clinic app managing appointments, reviews, doctors, services, and user profiles with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report specifying that the BookAppointmentDialog submit button must use a bright teal background (#0D9488), white text, hover transition, and CSS animation of 200–300ms.",
  "frontend-file-summaries.txt": "Auto-generated summary index of all frontend source files, describing the purpose and key implementation details of each component, page, and hook.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, charts, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app at #root and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with all routes (home, service detail pages, admin pages), QueryClient, ThemeProvider, and shared layout with Header/Footer.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that redirects unauthenticated or non-admin users to /access-denied, showing a spinner while auth state is loading.",
  "frontend/src/components/BackgroundParticles.tsx": "Decorative fixed-position background component that renders 18 randomly placed animated SVG particles (tooth, plus, sparkle, circle shapes) with floating CSS animations.",
  "frontend/src/components/BeforeAfterSlider.tsx": "A draggable before/after image comparison slider component supporting mouse and touch input, displaying dental treatment pairs (orthodontics, whitening, smile makeover) with scroll reveal animations.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog form for booking dental appointments, collecting patient name, phone, service type, and preferred date, then submitting via a React Query mutation with validation and success state.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top-of-page alert banner when the clinic status is 'closed' or 'emergency', fetched via a query hook, with distinct styling for each state.",
  "frontend/src/components/ContactSection.tsx": "A contact section displaying clinic phone, WhatsApp link, address, and hours alongside an embedded Google Maps iframe, with scroll-reveal animations.",
  "frontend/src/components/CustomCursor.tsx": "A stub component that disables any custom cursor implementation and renders nothing, deferring to the native OS cursor.",
  "frontend/src/components/DoctorProfile.tsx": "Renders a two-column doctor profile section with an image, bio, stats (experience, patients, success rate), and specialty tags for Dr. Priya Sharma, with scroll-reveal animations.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders four floating dental icon images (tooth, mirror, toothbrush, plus) with CSS bob animations and scroll-based parallax offsets as a decorative overlay.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, service links, contact details, a caffeine.ai attribution link, and a hidden tooth-logo button that opens an admin login modal.",
  "frontend/src/components/Header.tsx": "Sticky site header with desktop/mobile navigation links, a 'Book Appointment' button that opens BookAppointmentDialog, and a hamburger menu for mobile viewports.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, scroll-reveal animation, headline text, and buttons to open the booking dialog or scroll to services.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "A dialog-based admin login form that validates hardcoded credentials and navigates to the admin dashboard on success.",
  "frontend/src/components/HiddenAdminTrigger.tsx": "An invisible fixed element in the bottom-right corner that opens the admin login modal on double-click or mobile double-tap.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/ScrollProgressBar.tsx": "A fixed top progress bar that fills left-to-right based on the user's scroll position on the page.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of premium clickable service cards with hover animations and scroll-reveal effects, plus a row of standard service items.",
  "frontend/src/components/TestimonialCarousel.tsx": "An auto-scrolling infinite carousel of patient testimonials, using backend-approved reviews when available and falling back to static data.",
  "frontend/src/components/TypewriterText.tsx": "A component that animates text character-by-character once it enters the viewport, with configurable speed and HTML tag.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, then saves it via a mutation hook.",
  "frontend/src/components/ZoomInImage.tsx": "Image component that animates from scaled-down and transparent to full size when scrolled into view using the useScrollReveal hook.",
  "frontend/src/context/CursorContext.tsx": "React context that tracks and exposes a cursor icon state ('default' or 'dental') with a setter for global cursor customization.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGlassmorphismReveal.ts": "Hook that uses IntersectionObserver to set a visibility flag once an element scrolls into view, intended for glassmorphism reveal animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication on ICP, managing AuthClient lifecycle, login/logout, and exposing identity and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of TanStack Query hooks for all backend interactions including appointments, clinic status, services, and user profiles.",
  "frontend/src/hooks/useScrollReveal.ts": "Generic hook that uses IntersectionObserver to toggle a visibility boolean once a referenced element enters the viewport.",
  "frontend/src/hooks/useTextScramble.ts": "Hook that triggers a character-scramble animation on text when its referenced element scrolls into view, progressively resolving to the target string.",
  "frontend/src/index.css": "Global stylesheet defining OKLCH CSS custom properties for theming, animated mesh gradient background, glassmorphism utilities, and scroll reveal transition classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDenied.tsx": "Full-page component displayed when a user lacks permission, showing an alert icon and a button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments with patient details, status badges, and action buttons to confirm or cancel pending appointments using query hooks.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, description input, and upload progress tracking, storing images via ExternalBlob.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page with a form to submit patient reviews (name, text, star rating) that are saved in a pending state awaiting approval before public display.",
  "frontend/src/pages/admin/Dashboard.tsx": "Main admin dashboard showing clinic status controls (open/closed/emergency), a tabbed appointments table with status badges, and navigation links to other admin sections.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors (name and specialty) and listing all existing doctors, using React Query hooks and toast notifications.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin page for moderating pending patient reviews, allowing admins to approve or delete each review with star ratings and optional photos.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin page for editing a fixed list of premium dental services, supporting display name, description, and featured photo upload with progress tracking.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the Dental Implants service, featuring a hero section, benefits grid, and step-by-step process with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/Home.tsx": "Main home page that composes all major sections (hero, services, doctor profile, before/after slider, testimonials, contact) along with a clinic status banner and floating decorative elements.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service, showcasing benefits, a before/after slider, and a CTA section with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for the Laser Dentistry service, highlighting benefits and treatment types with an animated laser-beam hero decoration, scroll-reveal sections, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for the Pediatric Dentistry service, presenting child-friendly features and a 'healthy habits' section with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Generic service detail page that fetches service data by route param, displays a featured photo, description, and feature list, and opens a booking dialog.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Detail page for the Smile Makeover service, featuring a hero section, list of included treatments, a before/after slider, and a CTA with a booking dialog. Uses scroll-reveal animations throughout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom OKLCH-based semantic colors, teal/royal-blue palettes, custom fonts, glow shadows, and animation keyframes.",
  "project_state.json": "Tracks project state (version 17) for a premium dental clinic website, documenting features, architectural notes, color palette, animation choices, admin panel design, and known issues."
}