{
  "backend/main.mo": "Main Motoko actor for a dental clinic app managing appointments, reviews, doctors, services, user profiles, and clinic status with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a fix to the BookAppointmentDialog component to prevent the connection-error/retry banner from appearing on initial load or due to stale localStorage data.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the purpose and key implementation details of each component, hook, and page.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the React app titled 'XYZ Dental Clinic' that mounts the app into a root div.",
  "frontend/src/App.tsx": "Root React app component that sets up TanStack Router with public and admin route trees, QueryClient, ThemeProvider, and shared layout components including Header, Footer, and ClinicStatusBanner.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that verifies both a sessionStorage admin flag and a valid Internet Identity before granting access to admin routes, redirecting unauthenticated users to home.",
  "frontend/src/components/BackgroundParticles.tsx": "Animated background component that renders floating dental emoji particles using requestAnimationFrame with fade-in/out lifecycle management.",
  "frontend/src/components/BeforeAfterSlider.tsx": "Renders a draggable before/after image comparison slider component supporting mouse and touch events, cycling through three dental treatment image pairs (braces, whitening, smile makeover).",
  "frontend/src/components/BookAppointmentDialog.tsx": "A dialog form for booking dental appointments that persists incomplete submissions to localStorage, restores pending data on reopen, and submits via a React Query mutation with success/error state handling.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top-of-page banner when the clinic is closed or in emergency-only mode, with color-coded styling and appropriate messaging fetched via a status query hook.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact information section with animated heading, four info cards (phone, email, address, hours), and a WhatsApp deep-link button.",
  "frontend/src/components/CustomCursor.tsx": "A disabled custom cursor component that renders nothing, deferring to the native OS cursor.",
  "frontend/src/components/DoctorProfile.tsx": "Displays a doctor profile section with photo, animated heading, bio, key stats, and specialty tags for Dr. Priya Sharma.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders fixed, low-opacity floating dental icon images (tooth, toothbrush, mirror, plus) with CSS bob animations as a decorative background layer.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick links, services list, contact details, and a hidden admin login modal triggered by clicking the logo.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with scroll-aware styling, smooth-scroll nav links, mobile menu toggle, and a 'Book Now' button that opens the appointment dialog when the clinic is open.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, animated floating dental icons, headline stats, and a conditional 'Book Appointment' button tied to clinic open status.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "Two-step admin login modal that first validates hardcoded credentials then triggers Internet Identity authentication before redirecting to the admin dashboard.",
  "frontend/src/components/HiddenAdminTrigger.tsx": "Empty file with no content.",
  "frontend/src/components/LiquidGradientBackground.tsx": "Canvas-based animated background that renders mouse-reactive floating gradient blobs and subtle sine-wave overlays in a light blue color palette.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and a loading spinner during authentication.",
  "frontend/src/components/MagneticButton.tsx": "Wrapper component that applies a magnetic hover effect by translating its child element toward the cursor on mouse move and resetting on mouse leave.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that fills horizontally based on the user's scroll position through the page.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of dental services using static data optionally overridden by backend data, with IntersectionObserver-driven staggered card reveal animations.",
  "frontend/src/components/TestimonialCarousel.tsx": "Renders an auto-scrolling infinite carousel of patient testimonials with star ratings, using requestAnimationFrame for smooth animation and a staggered text reveal for the section heading.",
  "frontend/src/components/TypewriterText.tsx": "A component that types out text character-by-character once it scrolls into view, using the useScrollReveal hook to trigger the animation.",
  "frontend/src/components/UserProfileSetup.tsx": "Displays a modal dialog prompting authenticated users without a profile to enter their name, then saves it via the useSaveCallerUserProfile mutation.",
  "frontend/src/components/ZoomInImage.tsx": "An image component that scales and fades in from a reduced size when it enters the viewport, using the useScrollReveal hook.",
  "frontend/src/context/CursorContext.tsx": "Provides a React context for tracking and updating a cursor icon state ('default' or 'dental') across the application.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) based on the current Internet Identity, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useGlassmorphismReveal.ts": "An IntersectionObserver hook that sets isVisible to true once the referenced element reaches the specified scroll threshold, intended for glassmorphism reveal animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, clinic status, appointments, services, doctors, reviews, and before/after image pairs.",
  "frontend/src/hooks/useScrollReveal.ts": "A generic IntersectionObserver hook that returns a ref and isVisible boolean, triggering once when the element scrolls into view at the given threshold.",
  "frontend/src/hooks/useStaggeredTextReveal.ts": "Splits a string into words and returns per-word inline styles that stagger a fade-and-slide-up animation when the referenced element enters the viewport.",
  "frontend/src/hooks/useTextScramble.ts": "Animates text by scrambling characters and progressively resolving them to the target string over ~1 second once the element scrolls into view, running only once per mount.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Playfair Display fonts, sets up Tailwind, defines CSS custom properties for light/dark themes using oklch colors, and declares keyframe animations and utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AccessDenied.tsx": "A full-page access denied screen with a shield icon and a button that navigates back to the home route using TanStack Router.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments in a table with auto-refresh every 8 seconds, displays status badges, and allows inline status updates via a dropdown.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, upload progress tracking, and a description field, persisted via the addBeforeAfterPair mutation.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin form page for submitting patient reviews (name, text, star rating) that enter a pending state awaiting approval before public display.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard page displaying navigation cards for all admin sections (appointments, services, reviews, etc.) and a clinic status toggle (open/closed/emergency) with logout functionality.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors (name and specialty) and listing existing doctors, using React Query mutations and toast notifications.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin moderation page that lists pending patient reviews with star ratings and allows approving or deleting each review via React Query mutations.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin CMS page for editing display name, description, and featured photo for a predefined list of dental services, with upload progress tracking and save state feedback.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the Dental Implants service featuring a hero section with an image, a benefits grid, and a booking dialog triggered by a 'Book Now' button.",
  "frontend/src/pages/Home.tsx": "Main landing page that composes all major sections (Hero, Services, Doctor Profile, Before/After, Testimonials, Contact) with scroll-reveal animations applied to each section.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service with a hero section, an embedded BeforeAfterSlider, a benefits grid, and a booking dialog.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for the Laser Dentistry service featuring a styled hero with a decorative laser beam element, a benefits section, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for the Pediatric Dentistry service with a green-themed hero, a 'Why Kids Love Us' features grid, and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Displays a detail page for a specific dental service fetched by serviceId, showing a featured photo, description, feature highlights, and a booking dialog trigger.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Renders a dedicated Smile Makeover detail page with a hero section, before/after slider, included treatments list, and a booking appointment dialog.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, persist, and clear URL query parameters from both standard query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (teal, royal-blue, CSS variable-based semantic colors), fonts, border radii, box shadows, and keyframe animations including mesh gradient and float bob effects.",
  "project_state.json": "Tracks the project state for an appointment booking app, recording a known bug where the 'Connection issue' retry banner appears unexpectedly, with a feature request to fix BookAppointmentDialog to only show the banner on actual network failures and clear stale localStorage on mount."
}