{
  "backend/main.mo": "Main Motoko actor defining the dental clinic backend with types and CRUD operations for appointments, reviews, doctors, services, and user profiles, with role-based access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades existing actor state by adding a `state` field (defaulting to `#pending`) to all reviews and introducing a new empty `services` map.",
  "feature_evidence.json": "JSON report mapping implemented features (Service Manager, Review Approver workflow, glassmorphism styling) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of every frontend source file, serving as a reference index for the project's React components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes (home, service detail pages, admin panel sections) and wraps the app in QueryClient, ThemeProvider, and CursorContextProvider.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that redirects unauthenticated or non-admin users to the access-denied page while showing a loading spinner during auth checks.",
  "frontend/src/components/BeforeAfterSlider.tsx": "A draggable before/after image comparison slider component that supports both mouse and touch interactions, revealing before/after treatment images by clipping based on slider position.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog form for booking dental appointments, collecting patient name, contact info, preferred date, and service type, with Internet Identity authentication and ICP canister integration.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top-of-page alert banner when the clinic status is 'closed' or 'emergency', fetched from the backend, with appropriate styling and messaging for each state.",
  "frontend/src/components/ContactSection.tsx": "A contact section displaying clinic phone, address, and hours alongside a WhatsApp chat button and an embedded Google Maps iframe showing the clinic location.",
  "frontend/src/components/CustomCursor.tsx": "A custom animated cursor component that smoothly follows the mouse using requestAnimationFrame and renders either a dental tooth SVG or a medical cross SVG based on the cursor context.",
  "frontend/src/components/DoctorProfile.tsx": "A static section displaying the doctor's profile photo, credentials, bio, key stats, and specialty tags in a styled glass-card grid layout.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders decorative floating dental icon images with CSS bob animations and scroll-based parallax offsets positioned around the page edges.",
  "frontend/src/components/Footer.tsx": "A site footer with brand info, quick links, services list, and social media icons, plus a hidden admin login modal triggered by triple-clicking the copyright text.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop and mobile-responsive menu, containing links to Home, Services, Contact, and a LoginButton component.",
  "frontend/src/components/HeroSection.tsx": "Full-height hero section with a parallax background image, headline text, and a 'Book Appointment' button that opens the BookAppointmentDialog.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "A hidden admin login dialog that validates hardcoded credentials and navigates to the admin dashboard on success.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login/logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that tracks and visually displays the user's scroll position as a percentage of the page height.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of standard and premium dental services with custom animated card variants (bubble, laser, implant) and navigation to individual service pages.",
  "frontend/src/components/TestimonialCarousel.tsx": "Auto-scrolling infinite carousel of patient reviews, fetching approved reviews from the backend and falling back to hardcoded testimonials if none are available.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts newly authenticated users to enter their name and saves it as their profile via a backend mutation.",
  "frontend/src/context/CursorContext.tsx": "React context that provides and manages a global cursor icon state (default or dental) for use across components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, clinic status, reviews, and appointments with appropriate cache invalidation.",
  "frontend/src/hooks/useTextScramble.ts": "Custom hook that animates text with a scramble effect when the target element scrolls into view, progressively resolving random characters to the target string.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for theming, Tailwind imports, animated mesh gradient background, and utility classes for glassmorphism and dental-themed animations.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AccessDenied.tsx": "Simple page component displaying an access denied message with a shield icon and a button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all clinic appointments with status filtering and allows admins to update individual appointment statuses via a dropdown, with toast notifications for success/failure.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page providing a form to submit new patient reviews (name, text, star rating) that enter a pending state awaiting approval before going public.",
  "frontend/src/pages/admin/Dashboard.tsx": "Main admin dashboard that displays clinic status controls (open/closed/emergency) and navigation cards linking to all admin sub-pages.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page with a form to add new doctors (name and specialty) and a list displaying all currently registered doctors.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin page that lists pending reviews with star ratings and provides approve/reject actions to moderate reviews before they appear publicly.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin page for editing dental service details (name, description, featured photo with drag-and-drop upload) for a predefined list of services, syncing with backend data.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the dental implants service, showcasing benefits, the treatment process, and a booking dialog trigger with animated layout sections.",
  "frontend/src/pages/Home.tsx": "Main landing page that composes all major sections (header, hero, services, doctor profile, testimonials, contact, footer) and conditionally shows a user profile setup dialog for newly authenticated users.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service, displaying benefits, a 6-step treatment process, a before/after slider comparison, and a booking dialog trigger.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for the Laser Dentistry service, showcasing benefits, a step-by-step treatment process with animated laser decorations, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for Pediatric Dentistry, featuring child-friendly benefits, a visit process list, animated bubble background decorations, and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Generic service detail page that renders content for root canal, braces, whitening, or implants based on a URL parameter, showing benefits, process steps, and a booking dialog.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Detail page for the Smile Makeover service, including a benefits list, multi-step process, a before/after slider gallery of patient transformations, and a booking dialog.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist values in sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom color palette (royal-blue, teal, CSS-variable-based tokens), typography fonts, border radii, and custom animations for the dental clinic UI.",
  "project_state.json": "Project state snapshot (version 7) describing the premium dental clinic website's features, architectural notes, known issues, required image assets, and a catalogue of existing implemented features."
}