{
  "backend/main.mo": "Main Motoko actor for the dental clinic backend, defining data types and CRUD operations for appointments, reviews, doctors, services, before/after gallery, and user profiles, with role-based access control via mixins.",
  "feature_evidence.json": "JSON report mapping feature IDs to their titles, affected files, component dependencies, and test IDs, documenting UI/UX requirements for the dental clinic frontend.",
  "frontend-file-summaries.txt": "A JSON object containing one-line summaries of every frontend source file, serving as a quick reference for the purpose and key details of each component, page, and hook.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom property design tokens for light and dark themes including colors, borders, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'XYZ Dental Clinic' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all public, service detail, and admin routes, wraps the app in QueryClient and ThemeProvider, and defines Layout and AdminLayout components.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that redirects unauthenticated or non-admin users to the access-denied page, showing a spinner while authentication and admin status are being resolved.",
  "frontend/src/components/BackgroundParticles.tsx": "Decorative fixed-position background component that renders 18 randomly positioned, animated SVG particles (tooth, plus, sparkle, circle shapes) with low opacity for visual ambiance.",
  "frontend/src/components/BeforeAfterSlider.tsx": "A draggable before/after image comparison slider component that fetches pairs from an API or falls back to static defaults, rendering each pair with a draggable divider handle supporting both mouse and touch events.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog form for booking dental appointments, collecting patient name, phone, service type, and preferred date, then submitting via a mutation hook and showing a confirmation message on success.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top-of-page alert banner when the clinic status is 'closed' or 'emergency', fetched via a query hook, with appropriate icons and messages for each state.",
  "frontend/src/components/ContactSection.tsx": "A scroll-animated contact section displaying clinic phone, WhatsApp link, address, and hours alongside an embedded Google Maps iframe.",
  "frontend/src/components/CustomCursor.tsx": "A disabled custom cursor component that renders nothing, deferring to the native OS cursor.",
  "frontend/src/components/DoctorProfile.tsx": "A scroll-animated section showcasing the doctor's profile photo, bio, experience stats, and specialty tags in a two-column layout.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders four floating dental icon images with CSS bob animations and scroll-based parallax offsets, positioned absolutely as non-interactive decorative elements.",
  "frontend/src/components/Footer.tsx": "A site footer with brand info, quick links, contact details, a caffeine.ai attribution link, and a hidden admin login modal triggered by a low-opacity tooth icon button.",
  "frontend/src/components/Header.tsx": "Sticky site header with brand logo, desktop/mobile navigation links, and a 'Book Appointment' button that opens the BookAppointmentDialog.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, scroll-reveal animation, headline text, and buttons to book an appointment or navigate to services.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "A dialog modal with hardcoded credential validation that redirects to the admin dashboard on successful login.",
  "frontend/src/components/HiddenAdminTrigger.tsx": "An invisible fixed element in the bottom-right corner that opens the admin login modal on double-click or double-tap.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/ScrollProgressBar.tsx": "A fixed top progress bar that fills left-to-right based on the user's scroll position on the page.",
  "frontend/src/components/ServicesGrid.tsx": "Displays a grid of premium service cards (with hover effects and navigation) and a list of standard services, both with scroll-reveal animations.",
  "frontend/src/components/TestimonialCarousel.tsx": "An auto-scrolling infinite carousel of patient testimonials, using backend-fetched reviews when available or falling back to static data.",
  "frontend/src/components/TypewriterText.tsx": "A component that animates text character-by-character once it enters the viewport using a scroll-reveal hook.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, then saves it via a mutation hook.",
  "frontend/src/components/ZoomInImage.tsx": "Image component that animates from scaled-down and transparent to full size when scrolled into view using the useScrollReveal hook.",
  "frontend/src/context/CursorContext.tsx": "React context that tracks and exposes a cursor icon state ('default' or 'dental') with a setter for global cursor customization.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGlassmorphismReveal.ts": "Hook that uses IntersectionObserver to set a visibility flag when an element enters the viewport, intended for glassmorphism reveal animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Hook and provider for Internet Identity authentication on ICP, managing AuthClient lifecycle, login/logout, and exposing identity and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Centralized collection of React Query hooks for all backend interactions including appointments, clinic status, services, reviews, and user profiles.",
  "frontend/src/hooks/useScrollReveal.ts": "Generic hook that uses IntersectionObserver to toggle a visibility boolean when a referenced element scrolls into view, triggering once per element.",
  "frontend/src/hooks/useTextScramble.ts": "Hook that animates text with a scramble effect when the element enters the viewport, progressively resolving random characters to the target string.",
  "frontend/src/index.css": "Global stylesheet defining the OKLCH color system, Tailwind base layers, animated mesh gradient background, scroll reveal animations, and glassmorphism utilities.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessDenied.tsx": "Full-page access denied screen with a shield icon and a button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments with patient details, status badges, and buttons to confirm or cancel pending appointments using query hooks.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, description input, upload progress tracking, and display of existing pairs.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page with a form to submit patient reviews (name, text, star rating) that are saved in a pending state awaiting approval.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard showing clinic status controls (open/closed/emergency), a tabbed appointments table with status badges, and navigation links to other admin sections.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors (name and specialty) and listing all existing doctors, using React Query hooks and toast notifications.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin page for moderating pending patient reviews, allowing admins to approve or delete each review with star ratings and optional photos.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin page for editing a fixed list of premium dental services, supporting display name, description, and featured photo upload with progress tracking.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the Dental Implants service, featuring a hero section, benefits grid, and step-by-step process timeline with scroll-reveal animations and a booking dialog.",
  "frontend/src/pages/Home.tsx": "Main home page that composes all major sections: clinic status banner, hero, services grid, doctor profile, before/after slider, testimonials, and contact.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service, showcasing benefits, a before/after slider, and a booking dialog with scroll-reveal animations throughout.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for Laser Dentistry, highlighting benefits and specific treatments with an animated laser-beam hero decoration, scroll-reveal sections, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for Pediatric Dentistry, presenting child-friendly features and early-habit messaging with a colorful hero, scroll-reveal animations, and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Generic service detail page that fetches service data by route param, displays a featured photo, description, and key features, with a booking dialog and loading spinner.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Detail page for the Smile Makeover service, featuring a hero section, list of included treatments, before/after image sliders, and a booking dialog with scroll-reveal animations throughout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (including hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom colors (teal, royal-blue, CSS variable-based semantic tokens), fonts, shadows, and animations including mesh gradient and float effects.",
  "project_state.json": "Tracks project state version 19 for a premium dental clinic website, documenting features, architectural notes, design decisions (GSAP animations, glassmorphism, admin panel via footer tooth logo), and known issues."
}