{
  "backend/main.mo": "Main Motoko actor for a dental clinic app managing appointments, reviews, doctors, services, before/after gallery, and user profiles with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that all Caffeine AI references were removed from the Footer component, with high confidence and a single test requirement.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files describing the purpose and key details of each component, page, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the React SPA titled 'XYZ Dental Clinic' that mounts the app at the #root div.",
  "frontend/src/App.tsx": "Root React app configuring TanStack Router with all public and admin routes, wrapping the tree in QueryClientProvider, ThemeProvider, and global UI elements like ScrollProgressBar and LiquidGradientBackground.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that verifies both a sessionStorage admin flag and a valid Internet Identity before rendering admin children, redirecting unauthenticated users to home.",
  "frontend/src/components/BackgroundParticles.tsx": "Animated background component that spawns and fades floating dental emoji particles using requestAnimationFrame, capped at 12 simultaneous particles.",
  "frontend/src/components/BeforeAfterSlider.tsx": "A React component that renders a draggable before/after image comparison slider with three static dental treatment pairs, supporting both mouse and touch interactions.",
  "frontend/src/components/BookAppointmentDialog.tsx": "A modal dialog component for booking dental appointments, with a form for patient name, contact info, date, and service type, using a mutation hook to submit to the backend and showing a success state on completion.",
  "frontend/src/components/ClinicStatusBanner.tsx": "Displays a top banner when the clinic is closed or in emergency-only mode, with appropriate styling and messaging for each status.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact information section with cards for phone, email, address, and hours, plus a WhatsApp link, using a staggered text reveal animation for the heading.",
  "frontend/src/components/CustomCursor.tsx": "A placeholder component for a custom cursor that is currently disabled, returning null to use the native OS cursor.",
  "frontend/src/components/DoctorProfile.tsx": "Displays a profile section for Dr. Priya Sharma with her photo, bio, stats, and specialty tags, using a staggered text reveal animation for the heading.",
  "frontend/src/components/FloatingDentalElements.tsx": "Renders fixed-position, semi-transparent floating dental icon images in the background with a bobbing CSS animation.",
  "frontend/src/components/Footer.tsx": "A site footer with brand info, quick links, services list, and contact details, plus a hidden admin login modal triggered from within the footer.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with scroll-aware styling, smooth-scroll nav links, mobile menu toggle, and a 'Book Appointment' button that opens a dialog.",
  "frontend/src/components/HeroSection.tsx": "Full-viewport hero section with a background image, animated floating dental icons, staggered text reveal heading, and a call-to-action button that opens the booking dialog.",
  "frontend/src/components/HiddenAdminLoginModal.tsx": "Two-step admin login modal that validates hardcoded credentials then triggers Internet Identity authentication before redirecting to the admin dashboard.",
  "frontend/src/components/HiddenAdminTrigger.tsx": "Empty file with no content.",
  "frontend/src/components/LiquidGradientBackground.tsx": "Canvas-based animated background that renders a mouse-reactive liquid gradient with soft radial color blobs using requestAnimationFrame.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing appropriate icons and a loading spinner during authentication.",
  "frontend/src/components/MagneticButton.tsx": "Wrapper component that applies a magnetic hover effect, translating its children toward the cursor on mouse move and resetting on mouse leave.",
  "frontend/src/components/ScrollProgressBar.tsx": "Fixed top progress bar that fills horizontally based on the user's scroll position on the page.",
  "frontend/src/components/ServicesGrid.tsx": "Grid section displaying dental services fetched from the backend (with static fallback), each card navigating to a service detail page with hover glow effects.",
  "frontend/src/components/TestimonialCarousel.tsx": "Renders an auto-scrolling infinite carousel of patient testimonials with star ratings, using requestAnimationFrame for smooth animation and a staggered text reveal for the section heading.",
  "frontend/src/components/TypewriterText.tsx": "A component that types out text character-by-character once it scrolls into view, using the useScrollReveal hook to trigger the animation.",
  "frontend/src/components/UserProfileSetup.tsx": "Displays a modal dialog prompting newly authenticated users to enter their name and create a profile, using Internet Identity auth state and React Query mutations.",
  "frontend/src/components/ZoomInImage.tsx": "Wraps an image with a scroll-triggered zoom-in and fade-in animation using the useScrollReveal hook.",
  "frontend/src/context/CursorContext.tsx": "Provides a React context for tracking and setting a cursor icon type ('default' or 'dental') across the app without hiding the native cursor.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useGlassmorphismReveal.ts": "An IntersectionObserver hook that sets isVisible to true once the referenced element enters the viewport, intended for triggering glassmorphism reveal animations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via @dfinity/auth-client, exposing login/logout functions, identity state, and login status through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for the app's backend actor, covering user profiles, appointments, clinic status, reviews, and doctor availability with appropriate cache invalidation.",
  "frontend/src/hooks/useScrollReveal.ts": "A generic IntersectionObserver hook that returns a ref and isVisible boolean, triggering once when the element scrolls into view at a configurable threshold.",
  "frontend/src/hooks/useStaggeredTextReveal.ts": "Splits a string into words and returns per-word inline styles that stagger a fade-and-slide-up animation when the referenced element enters the viewport.",
  "frontend/src/hooks/useTextScramble.ts": "Animates text with a scramble effect on scroll-into-view, progressively resolving random characters to the target string over ~1 second using setInterval.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, defines CSS custom properties for light/dark themes using oklch colors, and declares keyframe animations (floatBob, scrollPulse, successPop, fadeSlideUp, spin) plus scroll-reveal utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AccessDenied.tsx": "Full-page access denied screen displayed when a user lacks admin permissions, with a styled card and a button to navigate back to the home page.",
  "frontend/src/pages/admin/Appointments.tsx": "Admin page that lists all appointments in a table and allows updating each appointment's status, with loading, error, and refresh handling.",
  "frontend/src/pages/admin/BeforeAfterManager.tsx": "Admin page for uploading before/after image pairs with drag-and-drop support, description input, and upload progress tracking.",
  "frontend/src/pages/admin/ContentManager.tsx": "Admin page with a form to submit patient reviews (name, text, star rating) that enter a pending state awaiting approval.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard page displaying navigation cards for all admin sections (appointments, services, reviews, etc.) and a clinic status toggle (open/closed/emergency) with logout functionality.",
  "frontend/src/pages/admin/DoctorScheduler.tsx": "Admin page for adding new doctors (name and specialty) and listing existing doctors, using React Query hooks to fetch and mutate doctor data.",
  "frontend/src/pages/admin/ReviewApprover.tsx": "Admin page for moderating pending patient reviews, allowing admins to approve or delete each review with star ratings and optional photos displayed.",
  "frontend/src/pages/admin/ServiceManager.tsx": "Admin CMS page for editing a predefined list of dental services, supporting display name, description, and featured photo upload with save/progress state per service.",
  "frontend/src/pages/DentalImplantsDetail.tsx": "Detail page for the Dental Implants service featuring a hero section with an image, a benefits grid, and a booking dialog triggered by a 'Book Now' button.",
  "frontend/src/pages/Home.tsx": "Main landing page that composes all major sections (Hero, Services, Doctor Profile, Before/After, Testimonials, Contact) with scroll-reveal animations applied to each section.",
  "frontend/src/pages/InvisalignDetail.tsx": "Detail page for the Invisalign service featuring a hero section, an embedded BeforeAfterSlider, a benefits grid, and a booking dialog.",
  "frontend/src/pages/LaserDentistryDetail.tsx": "Detail page for the Laser Dentistry service with a dark purple hero section containing a decorative laser beam element, a benefits section, and a booking dialog.",
  "frontend/src/pages/PediatricDentistryDetail.tsx": "Detail page for the Pediatric Dentistry service with a green-themed hero section, a 'Why Kids Love Us' features grid, and a booking dialog.",
  "frontend/src/pages/ServiceDetail.tsx": "Displays a detail page for a specific dental service fetched by ID, showing a featured photo, description, feature highlights, and a booking dialog trigger.",
  "frontend/src/pages/SmileMakeoverDetail.tsx": "Static detail page for the Smile Makeover service featuring a hero section, before/after slider, and a list of included treatments with a booking dialog.",
  "frontend/src/utils/urlParams.ts": "Utility module providing helper functions to read, store, persist, and clear URL query parameters from both regular query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (teal, royal-blue, semantic CSS variable-based colors), fonts, border radii, box shadows, and animations including mesh gradient and float bob keyframes.",
  "project_state.json": "Tracks the current state of the Dental Clinic web project, recording existing features and pending requests focused on removing all 'Caffeine AI' branding from the footer, header, and all other frontend components."
}