{
  "kind": "build_request",
  "title": "Fix unexpected 'Connection issue' error in appointment booking",
  "projectName": "XYZ Dental Clinic",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the BookAppointmentDialog component so that the 'Connection issue. Your data has been saved locally. Please click \"Retry\" to try again' message does not appear unexpectedly. The error/retry banner should only be shown when there is an actual, confirmed network or canister call failure — not on initial load, not when localStorage contains stale data from a previous session, and not when the form has not yet been submitted. Clear any stale localStorage pending appointment data that would incorrectly trigger this state on mount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "now solve it apoint ment book vala problem hau Connection issue. Your data has been saved locally. Please click \"Retry\" to try again"
        ]
      },
      "acceptanceCriteria": [
        "Opening the BookAppointmentDialog for the first time does not show the 'Connection issue' banner.",
        "The 'Connection issue. Your data has been saved locally. Please click \"Retry\" to try again' banner only appears after a real failed backend submission attempt.",
        "Stale localStorage pending appointment entries from previous sessions do not trigger the connection error/retry UI on dialog open.",
        "After a successful appointment submission, any pending localStorage entry is cleared and the retry banner is not shown on the next dialog open.",
        "The Retry button, when clicked after a genuine failure, re-attempts submission using the locally saved data."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Only fix the connection error banner logic — do not alter unrelated booking form fields or submission flow."
  ],
  "nonGoals": [
    "Redesigning the appointment booking form UI.",
    "Changing backend appointment storage or schema.",
    "Adding new form fields or validation rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}