{
  "kind": "build_request",
  "title": "Style 'Book Appointment' submit button with bright teal/blue color",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-71",
      "text": "In the BookAppointmentDialog component, style the submit 'Book Appointment' / 'Book Now' button with a bright teal or royal-blue background color (e.g., the site's teal accent — #0D9488 or equivalent OKLCH token) so it stands out prominently against the white form background. The button must have white text, a smooth hover state (slightly darker shade or glow), and a CSS transition of ~200–300ms. All other form elements remain white/light as-is.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Form ko white karne ke baad, \"Book Appointment\" ka button Bright Teal ya Blue rakhiyega, taaki pure safed form mein wo alag se chamke aur log uspar click karein."
        ]
      },
      "acceptanceCriteria": [
        "The submit button inside BookAppointmentDialog has a bright teal or royal-blue background (not white, not grey).",
        "Button text is white and clearly readable against the teal/blue background.",
        "On hover, the button transitions to a slightly darker teal/blue shade or emits a subtle glow, with a CSS transition of approximately 200–300ms.",
        "The rest of the form (inputs, labels, dialog background) remains white/light.",
        "The button styling is consistent across all viewports (desktop and mobile).",
        "No other UI elements are changed by this update."
      ]
    }
  ],
  "constraints": [
    "Do not change any form fields, layout, or submission logic in BookAppointmentDialog.",
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Use existing teal/royal-blue design tokens from tailwind.config.js or index.css — do not introduce new arbitrary color values."
  ],
  "nonGoals": [
    "Changing any other buttons on the site outside the BookAppointmentDialog submit button.",
    "Modifying form fields, validation logic, or submission behaviour.",
    "Altering the white form background or dialog styling beyond the button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}