{
  "kind": "build_request",
  "title": "Frictionless Zero-Login Appointment Booking",
  "projectName": "XYZ Dental Clinic",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-49",
      "text": "Update the backend appointment booking function to accept anonymous (unauthenticated) calls. The `bookAppointment` function must not require a caller principal/identity check — any anonymous user must be able to submit a booking with Name, Phone Number, Service, and Date/Time fields. Store all submitted appointments in the existing appointments data structure so they appear in the admin panel.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Appointment book karte waqt user se koi identity, password, ya account creation nahi maangna hai.",
          "Book Now click karte hi seedha Thank You message aaye aur data Admin Panel mein chala jaye. No OTP, No Login."
        ]
      },
      "acceptanceCriteria": [
        "The bookAppointment backend function accepts calls from anonymous principals without throwing an authorization error.",
        "Submitted appointments include Name, Phone Number, Service, and Date fields.",
        "Appointments submitted anonymously appear in the admin Appointments panel with all submitted data visible.",
        "No identity, principal check, or authentication is required to submit an appointment."
      ]
    },
    {
      "id": "REQ-50",
      "text": "Replace the existing BookAppointmentDialog component with a fully frictionless booking form. Remove any Internet Identity login requirement or auth-gated logic from the booking flow. The form must contain exactly four fields: Patient Name (text input), Phone Number (tel input), Service (dropdown select populated with available services), and Preferred Date (date picker). On successful submission, display an inline 'Thank You! Your appointment has been booked. We will contact you shortly.' confirmation message inside the dialog — no redirect, no login prompt. The 'Book Now' button must be immediately accessible without any authentication step.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Sirf 3-4 simple fields honi chahiye: Name, Phone Number, Service Select, aur Date.",
          "Book Now click karte hi seedha Thank You message aaye aur data Admin Panel mein chala jaye. No OTP, No Login.",
          "User ko appointment book karte waqt kisi bhi tarah ka Login, Identity, ya Sign-up nahi mangna chahiye"
        ]
      },
      "acceptanceCriteria": [
        "The booking dialog/form renders immediately when the 'Book Appointment' button is clicked — no login or identity prompt appears.",
        "The form contains exactly four fields: Patient Name, Phone Number, Service (dropdown), and Preferred Date.",
        "Submitting the form with valid data calls the backend bookAppointment function using an anonymous actor (no Internet Identity required).",
        "On successful submission, a 'Thank You' confirmation message is displayed inside the dialog.",
        "No OTP, no sign-up, no Internet Identity login step is present anywhere in the booking flow.",
        "The 'Book Appointment' CTA in the Hero section, Header, and service detail pages all open this frictionless form.",
        "Form submission is disabled and shows inline validation if Name or Phone Number is empty."
      ]
    },
    {
      "id": "REQ-51",
      "text": "Audit all public-facing pages (Home, HeroSection, service detail pages: DentalImplantsDetail, InvisalignDetail, LaserDentistryDetail, PediatricDentistryDetail, SmileMakeoverDetail, ServiceDetail) and remove any logic that gates the 'Book Appointment' button or booking dialog behind an authentication check or login state. Every 'Book Appointment' / 'Book Now' button on the public site must open the frictionless booking form directly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Booking process ekdum One-Click honi chahiye.",
          "User ko appointment book karte waqt kisi bhi tarah ka Login, Identity, ya Sign-up nahi mangna chahiye"
        ]
      },
      "acceptanceCriteria": [
        "No 'Book Appointment' button on any public page shows a login prompt or requires authentication.",
        "All 'Book Appointment' / 'Book Now' buttons across HeroSection, Header, and all service detail pages open the frictionless BookAppointmentDialog directly.",
        "Unauthenticated users can open and submit the booking form without being redirected or prompted to log in."
      ]
    }
  ],
  "constraints": [
    "Do not remove or modify the existing admin authentication system — the hidden admin login and AdminGuard must remain intact.",
    "The anonymous booking backend function must not expose or allow modification of any admin-only data.",
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding OTP verification or any phone number validation service.",
    "Sending SMS or email confirmation to the patient.",
    "Changing any admin panel authentication or access control.",
    "Adding a patient account or profile system.",
    "Modifying the review submission, before/after gallery, or any other backend functionality."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}