{
  "kind": "build_request",
  "title": "Remove all Caffeine AI branding from website",
  "projectName": "Dental Clinic",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all references to 'Caffeine AI' from the Footer component — including the name, any logo/icon, and any associated links or attribution text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Website ke footer, header ya kisi bhi section se 'Caffeine AI' ka naam, logo aur links puri tarah delete kar do."
        ]
      },
      "acceptanceCriteria": [
        "The Footer component contains no text, image, or hyperlink mentioning 'Caffeine AI'.",
        "No 'Powered by', 'Built with', or similar attribution referencing Caffeine AI appears in the footer."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove all references to 'Caffeine AI' from the Header component — including the name, any logo/icon, and any associated links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Website ke footer, header ya kisi bhi section se 'Caffeine AI' ka naam, logo aur links puri tarah delete kar do."
        ]
      },
      "acceptanceCriteria": [
        "The Header component contains no text, image, or hyperlink mentioning 'Caffeine AI'.",
        "Header layout and existing navigation links remain intact after removal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit and remove all references to 'Caffeine AI' (name, logo, links, or attribution) from every other page or section component across the entire frontend — including but not limited to Home, HeroSection, ContactSection, ServicesGrid, DoctorProfile, TestimonialCarousel, and all admin pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Website ke footer, header ya kisi bhi section se 'Caffeine AI' ka naam, logo aur links puri tarah delete kar do."
        ]
      },
      "acceptanceCriteria": [
        "A search across all frontend source files for the string 'Caffeine' returns zero results.",
        "No page, section, modal, or dialog displays any Caffeine AI branding, logo image, or link.",
        "All other existing content and functionality remains unaffected."
      ]
    }
  ],
  "constraints": [
    "Do not alter any other branding, content, or functionality while removing Caffeine AI references.",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui."
  ],
  "nonGoals": [
    "Replacing Caffeine AI branding with any other third-party attribution.",
    "Redesigning the footer, header, or any section layout beyond removing the Caffeine AI references.",
    "Any backend changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}