{
  "kind": "build_request",
  "title": "Fix Appointment Booking & Add Premium Animations",
  "projectName": "XYZ Dental Clinic",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the appointment booking form in BookAppointmentDialog.tsx so that form submissions save directly to the backend actor (no external service). On successful submit, display a green checkmark animation with the text 'Appointment Confirmed!' instead of the current error state. Ensure no Internet Identity login prompt or auth barrier appears for patients during booking — the form must be fully accessible to anonymous users.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Form directly backend mein save hoga (no external service needed)",
          "Submit hote hi Green Checkmark animation + 'Appointment Confirmed!' message",
          "Koi login barrier nahi patients ke liye"
        ]
      },
      "acceptanceCriteria": [
        "Patient can fill and submit the booking form without any login or identity prompt",
        "On successful submission, a green animated checkmark is shown with the text 'Appointment Confirmed!'",
        "The appointment is saved to the backend and visible in the Admin Appointments panel",
        "No 'Failed' error message appears on form submission under normal conditions"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a floating animation to the Hero section: a dental icon or doctor image should continuously float up and down (bob effect) when the page loads. The animation should be smooth and loop indefinitely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hero section mein ek dental icon ya doctor ki image dhire-dhire hawa mein 'float' (upar-neeche) karni chahiye"
        ]
      },
      "acceptanceCriteria": [
        "A dental icon or doctor image is visible in the Hero section",
        "The element continuously animates up and down in a smooth bobbing motion on page load",
        "Animation loops indefinitely without interruption"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make all 'Book Now' buttons magnetic: when the user's mouse cursor moves near a 'Book Now' button, the button should subtly translate toward the cursor, creating a magnetic attraction effect. The button should return to its original position when the cursor moves away.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Saare 'Book Now' buttons magnetic hone chahiye—jab mouse paas jaye, toh button uski taraf kheecha chala aaye"
        ]
      },
      "acceptanceCriteria": [
        "All 'Book Now' buttons respond to nearby mouse movement by translating toward the cursor",
        "The effect is smooth and proportional to cursor proximity",
        "Buttons return to their original position when the cursor moves away"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a staggered text reveal animation to all major section headings: each word in the heading should animate in one by one from below (bounce/slide up), creating a staggered entrance effect when the section scrolls into view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Heading ke words ek-ek karke 'bounce' hokar niche se upar aayein"
        ]
      },
      "acceptanceCriteria": [
        "Major section headings animate word-by-word on scroll into view",
        "Each word slides/bounces up from below with a staggered delay",
        "Animation triggers once when the heading enters the viewport"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Replace the static white background with a dynamic liquid blue gradient background. The gradient should animate continuously and create a wave/fluid effect that responds to mouse movement across the page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "White screen ki jagah piche ek Liquid Blue Gradient chalta rahe jo mouse move karne par 'wave' banaye"
        ]
      },
      "acceptanceCriteria": [
        "The page background displays an animated liquid blue gradient instead of a plain white background",
        "Moving the mouse across the page causes a subtle wave/fluid distortion in the gradient",
        "The animation runs smoothly without impacting page performance significantly"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a scroll-triggered progress indicator: a thin animated line (progress bar) fixed at the top of the page that fills from left to right as the user scrolls down, indicating how much of the page content remains.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Jaise-jaise user scroll kare, ek animated line chale jo dikhaye ki kitni website bachi hai"
        ]
      },
      "acceptanceCriteria": [
        "A thin progress bar is fixed at the top of the page",
        "The bar fills proportionally as the user scrolls down the page",
        "The bar is empty at the top and full at the bottom of the page",
        "The animation is smooth and updates in real time as the user scrolls"
      ]
    }
  ],
  "constraints": [
    "All existing admin panel features (Appointments, Before/After Manager, Reviews, etc.) must remain intact",
    "Admin login via footer tooth icon must continue to work",
    "Appointment booking must use the existing backend actor — no external services like Formspree or EmailJS",
    "Internet Identity login must NOT be required for patients to book appointments",
    "Immutable frontend paths (hooks, main.tsx, ui components) must not be modified"
  ],
  "nonGoals": [
    "Integrating third-party form services (Formspree, EmailJS)",
    "Changing the admin authentication mechanism",
    "Adding new backend data models beyond what is needed for appointment saving",
    "Modifying the Before/After Slider or Testimonial Carousel"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}