{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "XYZ Dental Clinic Premium Website with Animations and Admin Panel - Frontend Implementation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement scroll-triggered reveal animations using Framer Motion for text and images throughout the website",
      "acceptanceCriteria": [
        "Text elements fade in smoothly when scrolling into view",
        "Images slide up with fade effect when entering viewport",
        "Animations trigger once per element on first scroll"
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add framer-motion dependency for scroll-triggered animations"
        },
        {
          "path": "frontend/src/hooks/useScrollReveal.ts",
          "operation": "create",
          "description": "Create custom hook for scroll-triggered reveal animations that detects when elements enter viewport and triggers fade-in and slide-up effects once per element"
        },
        {
          "path": "frontend/src/components/AnimatedSection.tsx",
          "operation": "create",
          "description": "Create reusable wrapper component that applies scroll-triggered fade-in and slide-up animations to child elements using Framer Motion and the useScrollReveal hook"
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add parallax scrolling effect to background images creating depth perception",
      "acceptanceCriteria": [
        "Background images move slower than foreground content",
        "Parallax effect is smooth without janky performance",
        "Effect works on hero section and key image sections"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useParallax.ts",
          "operation": "create",
          "description": "Create custom hook that tracks scroll position and calculates parallax offset for background images with configurable speed factor"
        },
        {
          "path": "frontend/src/components/ParallaxSection.tsx",
          "operation": "create",
          "description": "Create reusable parallax container component that applies parallax effect to background images using the useParallax hook with smooth performance optimization"
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create micro-interactions for buttons with hover effects including smooth glow and scale-up animations",
      "acceptanceCriteria": [
        "Buttons scale up slightly on hover (1.05x)",
        "Glow effect appears smoothly on hover",
        "Transitions are smooth and professional"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global button hover animation styles including scale-up (1.05x) and glow effect with smooth transitions using Tailwind utilities"
        },
        {
          "path": "frontend/src/components/AnimatedButton.tsx",
          "operation": "create",
          "description": "Create reusable button component with built-in hover micro-interactions including scale-up and glow effects using Framer Motion"
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Integrate Lottie animations for dental procedures that sync with accompanying text descriptions",
      "acceptanceCriteria": [
        "Lottie animations load and play for dental procedures",
        "Animations sync with text scroll position or trigger",
        "Animations are lightweight and don't impact performance"
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add lottie-react dependency for Lottie animation playback"
        },
        {
          "path": "frontend/src/components/LottieAnimation.tsx",
          "operation": "create",
          "description": "Create wrapper component for Lottie animations that plays dental procedure animations synced with scroll position or viewport entry trigger"
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create hero section with high-quality image slider featuring dental work and prominent Book Appointment button",
      "acceptanceCriteria": [
        "Hero section displays full-width with professional dental imagery",
        "Book Appointment button is prominent and easily clickable",
        "Hero includes heading about perfect smiles",
        "Responsive layout works on mobile and desktop"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "create",
          "description": "Create hero section component with full-width layout displaying generated images from frontend/public/assets/generated/hero-bg.dim_1920x1080.png and frontend/public/assets/generated/smile-hero.dim_1200x800.png, featuring perfect smiles heading and prominent Book Appointment button with responsive design"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add HeroSection component to the top of the home page layout"
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build interactive before/after slider component where users can drag to compare treatment results",
      "acceptanceCriteria": [
        "Slider handle can be dragged horizontally",
        "Left side shows before image, right side shows after image",
        "Smooth dragging experience without lag",
        "Mobile touch support for dragging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BeforeAfterSlider.tsx",
          "operation": "create",
          "description": "Create interactive before/after comparison slider component with draggable handle, left showing before image and right showing after image, supporting both mouse and touch drag events with smooth performance"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add BeforeAfterSlider components to home page displaying treatment results using generated image pairs: before-whitening and after-whitening, before-braces and after-braces from frontend/public/assets/generated/"
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create services grid displaying dental services with animated icons and links to detail pages",
      "acceptanceCriteria": [
        "Grid layout displays multiple services in organized manner",
        "Each service has an animated icon",
        "Clicking a service navigates to its detail page",
        "Icons animate on hover or scroll into view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ServicesGrid.tsx",
          "operation": "create",
          "description": "Create services grid component displaying Root Canal, Braces, Whitening, and Implants services using generated icons from frontend/public/assets/generated/icon-root-canal.dim_256x256.png, icon-braces.dim_256x256.png, icon-whitening.dim_256x256.png, and icon-implants.dim_256x256.png with scroll-reveal animations and click navigation to detail pages"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add ServicesGrid component to home page layout"
        },
        {
          "path": "frontend/src/pages/ServiceDetail.tsx",
          "operation": "create",
          "description": "Create service detail page component displaying full information about each dental service with routing parameter for service type"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for ServiceDetail page with dynamic service parameter, ensuring proper routing from services grid"
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Build doctor profile section with photo, smooth entry animation, and credentials details",
      "acceptanceCriteria": [
        "Doctor photo displays prominently",
        "Section animates smoothly when scrolling into view",
        "Expertise and education information is clearly displayed",
        "Professional and trustworthy layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DoctorProfile.tsx",
          "operation": "create",
          "description": "Create doctor profile section component displaying doctor photo from frontend/public/assets/generated/doctor-profile.dim_600x800.png with scroll-triggered entry animation, expertise and education credentials in professional layout"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add DoctorProfile component to home page layout"
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Create auto-sliding testimonial carousel for patient reviews with manual navigation controls",
      "acceptanceCriteria": [
        "Testimonials auto-slide every few seconds",
        "Users can manually navigate between reviews",
        "Smooth transitions between testimonials",
        "Displays patient name and review text clearly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TestimonialCarousel.tsx",
          "operation": "create",
          "description": "Create auto-sliding testimonial carousel component that fetches reviews from backend using getAllReviews, displays patient names and review text with smooth transitions, includes manual navigation controls, and auto-advances every few seconds"
        },
        {
          "path": "frontend/src/hooks/useReviews.ts",
          "operation": "create",
          "description": "Create React Query hook for fetching reviews from backend getAllReviews method with proper caching and error handling"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add TestimonialCarousel component to home page layout"
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add live contact features including WhatsApp button, Google Maps embed, and clickable phone number",
      "acceptanceCriteria": [
        "WhatsApp button opens chat with clinic number",
        "Google Maps embed shows clinic location",
        "Phone number is clickable and initiates call on mobile",
        "All contact options are easily accessible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ContactSection.tsx",
          "operation": "create",
          "description": "Create contact section component with WhatsApp chat button (using web.whatsapp.com link), embedded Google Maps iframe showing clinic location, and clickable phone number link, ensuring all contact options are accessible and functional on mobile and desktop"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add ContactSection component to home page layout"
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Build admin dashboard with clinic status toggle displaying real-time banner on public site when status is Emergency or Closed",
      "acceptanceCriteria": [
        "Dashboard has toggle switch for clinic status",
        "Toggling status immediately updates backend",
        "Public website displays banner when status is Closed or Emergency",
        "Banner is prominent and clearly visible"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ClinicStatusBanner.tsx",
          "operation": "create",
          "description": "Create prominent banner component that fetches clinic status from backend getClinicStatus and displays warning banner when status is Closed or Emergency, positioned at top of public pages with royal blue and teal styling"
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add ClinicStatusBanner component at the top of home page layout before hero section"
        },
        {
          "path": "frontend/src/hooks/useClinicStatus.ts",
          "operation": "create",
          "description": "Create React Query hook for fetching clinic status from backend getClinicStatus method with polling for real-time updates"
        },
        {
          "path": "frontend/src/pages/admin/Dashboard.tsx",
          "operation": "create",
          "description": "Create admin dashboard page with clinic status toggle switch that calls backend setClinicStatus method, displaying current status and allowing admin to switch between Open, Closed, and Emergency modes. Use the authorization component to restrict access to admin users only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for admin Dashboard page under /admin/dashboard path with authorization guard ensuring only authenticated admin users can access"
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Create appointment manager interface in admin panel displaying all bookings with filtering and status updates",
      "acceptanceCriteria": [
        "All appointments display in organized table or list",
        "Admin can filter appointments by date range and status",
        "Admin can update appointment status",
        "Display shows patient details and service requested"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/Appointments.tsx",
          "operation": "create",
          "description": "Create appointment manager page fetching appointments from backend getAllAppointments, displaying organized table with patient details and service type, including date and status filters, and allowing status updates via backend updateAppointmentStatus method. Use the authorization component to restrict access to admin users only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAppointments.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching appointments from backend getAllAppointments and updating appointment status via updateAppointmentStatus with proper cache invalidation"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for admin Appointments page under /admin/appointments path with authorization guard"
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Build content management interface in admin panel for uploading photos, reviews, and before-after images",
      "acceptanceCriteria": [
        "Admin can upload new images through form interface",
        "Admin can add reviews with patient name and text",
        "Admin can create before-after pairs by uploading two images",
        "Uploaded content immediately appears on public site"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/ContentManager.tsx",
          "operation": "create",
          "description": "Create content management page with forms for adding reviews via backend addReview method, including fields for reviewer name, text, rating, and optional photo and before-after image uploads using ExternalBlob from blob-storage component. Use the authorization component to restrict access to admin users only. Use the blob-storage component to support image uploads. Verify both components' usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useContentManagement.ts",
          "operation": "create",
          "description": "Create React Query mutation hooks for adding reviews via backend addReview method with ExternalBlob handling for image uploads and proper cache invalidation"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for admin ContentManager page under /admin/content path with authorization guard"
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Create doctor availability scheduler interface in admin panel allowing modification of doctor schedules",
      "acceptanceCriteria": [
        "Admin can view current doctor schedules",
        "Admin can add new availability blocks with date and time",
        "Admin can mark doctors as unavailable for specific dates",
        "Changes save to backend immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/DoctorScheduler.tsx",
          "operation": "create",
          "description": "Create doctor scheduler page fetching doctors from backend getAllDoctors and their availability via getDoctorAvailability, displaying current schedules with forms for adding/modifying availability blocks via backend addDoctor method, including date pickers and time range selectors. Use the authorization component to restrict access to admin users only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useDoctors.ts",
          "operation": "create",
          "description": "Create React Query hooks for fetching doctors from backend getAllDoctors, getting availability via getDoctorAvailability, and managing doctor schedules with proper cache invalidation"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add route for admin DoctorScheduler page under /admin/doctors path with authorization guard"
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Implement authentication system restricting admin panel access to authorized users only",
      "acceptanceCriteria": [
        "Admin panel requires authentication to access",
        "Unauthorized users cannot view or modify admin content",
        "Authentication uses Internet Identity",
        "Authenticated users can access all admin features"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "create",
          "description": "Create route guard component that checks user authentication and admin role via backend isCallerAdmin method, redirecting unauthorized users to login or access denied page. Use the authorization component to implement role-based access control. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AccessDenied.tsx",
          "operation": "create",
          "description": "Create access denied page displaying message for unauthorized users attempting to access admin features"
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap all admin routes with AdminGuard component to enforce authentication and admin role checks, and add route for AccessDenied page"
        },
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "create",
          "description": "Create login/logout button component using Internet Identity from authorization component, handling authentication state and clearing cached data on logout. Use the authorization component for Internet Identity integration. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/UserProfileSetup.tsx",
          "operation": "create",
          "description": "Create user profile setup modal that appears on first login, prompting user for name and saving profile via backend saveCallerUserProfile method. Use the authorization component for profile management. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserProfile.ts",
          "operation": "create",
          "description": "Create React Query hook for fetching current user profile from backend getCallerUserProfile and saving profile via saveCallerUserProfile, implementing proper loading states to prevent profile setup modal flash as described in authorization component usage instructions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add LoginButton to main navigation and integrate UserProfileSetup modal that conditionally renders when authenticated user has no profile"
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Apply minimalist white, royal blue, and teal color palette throughout the website creating boutique high-end aesthetic",
      "acceptanceCriteria": [
        "Primary colors are white, royal blue, and teal",
        "Color scheme is consistent across all pages",
        "Design feels modern, clean, and professional",
        "High contrast for readability"
      ],
      "file_operations": [
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind theme with custom color palette defining royal blue and teal as primary colors, ensuring high contrast and boutique medical-professional aesthetic"
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS variables and base styles applying minimalist white, royal blue, and teal color scheme consistently across the website with modern, clean, professional styling"
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Render all generated images as static assets in frontend/public/assets/generated directory",
      "acceptanceCriteria": [
        "Generated images are stored in public/assets/generated",
        "Images are referenced correctly in components",
        "All images load properly on the website"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Verify generated images hero-bg.dim_1920x1080.png and smile-hero.dim_1200x800.png are correctly referenced from frontend/public/assets/generated/ and load properly"
        },
        {
          "path": "frontend/src/components/ServicesGrid.tsx",
          "operation": "modify",
          "description": "Verify generated service icons icon-root-canal.dim_256x256.png, icon-braces.dim_256x256.png, icon-whitening.dim_256x256.png, and icon-implants.dim_256x256.png are correctly referenced from frontend/public/assets/generated/ and load properly"
        },
        {
          "path": "frontend/src/components/DoctorProfile.tsx",
          "operation": "modify",
          "description": "Verify generated doctor profile image doctor-profile.dim_600x800.png is correctly referenced from frontend/public/assets/generated/ and loads properly"
        },
        {
          "path": "frontend/src/components/BeforeAfterSlider.tsx",
          "operation": "modify",
          "description": "Verify generated before-after image pairs before-whitening.dim_800x600.png, after-whitening.dim_800x600.png, before-braces.dim_800x600.png, and after-braces.dim_800x600.png are correctly referenced from frontend/public/assets/generated/ and load properly"
        },
        {
          "path": "frontend/src/components/ContactSection.tsx",
          "operation": "modify",
          "description": "Verify generated clinic images clinic-exterior.dim_1200x800.png and waiting-room.dim_1200x800.png are correctly referenced from frontend/public/assets/generated/ and load properly if used in contact section"
        }
      ]
    }
  ]
}