{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin panel appointments not loading",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix AdminGuard authentication flow and admin appointments loading",
      "acceptanceCriteria": [
        "Admin can log in via the hidden admin login modal and be redirected to the admin dashboard without errors.",
        "Navigating to the admin Appointments page loads and displays all appointments without a login error or empty state caused by auth failure.",
        "AdminGuard correctly reads 'adminAuth' from sessionStorage and does not redirect authenticated admins to the home page.",
        "The backend authorization check for fetching all appointments returns data successfully when called by an authenticated admin session.",
        "No console errors related to authentication or authorization appear when loading the Appointments page as an admin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminGuard.tsx",
          "operation": "modify",
          "description": "Fix the AdminGuard component to properly handle the admin authentication flow. Ensure that the sessionStorage check for 'adminAuth' correctly identifies authenticated admin sessions and passes valid auth state to child routes. Remove any race conditions in the useEffect that might cause premature redirects. Ensure the loading state properly waits for both sessionStorage verification and any async auth checks before rendering children or redirecting. The guard must allow authenticated admins to access protected routes without being redirected to the home page."
        },
        {
          "path": "frontend/src/components/HiddenAdminLoginModal.tsx",
          "operation": "modify",
          "description": "Review and ensure the admin login modal correctly stores the 'adminAuth' state in sessionStorage upon successful credential validation. Verify that the stored auth state format matches what AdminGuard expects to read. Ensure the navigation to the admin dashboard occurs after sessionStorage has been successfully updated, preventing any timing issues where AdminGuard checks before the auth state is persisted."
        },
        {
          "path": "frontend/src/pages/admin/Appointments.tsx",
          "operation": "modify",
          "description": "Ensure the Appointments page correctly handles the authenticated admin state passed from AdminGuard. Verify that the page's useQuery hook for fetching all appointments properly depends on the authenticated actor and does not attempt to call the backend before authentication is confirmed. Add error boundary handling to catch and display authorization errors gracefully. Ensure the page shows a proper loading state while appointments are being fetched and displays meaningful error messages if the backend returns authorization failures."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useGetAllAppointments query hook to ensure it properly handles admin authentication state. Verify that the query is enabled only when an authenticated admin actor is available. Ensure the hook correctly processes backend authorization errors and provides clear error states that the UI can display. Add retry logic that respects authentication failures and does not infinitely retry on authorization errors."
        }
      ]
    }
  ]
}