{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frictionless Zero-Login Appointment Booking",
  "requirements": [
    {
      "id": "REQ-50",
      "summary": "Replace BookAppointmentDialog with a fully frictionless booking form that requires no authentication and displays an inline confirmation message on success",
      "acceptanceCriteria": [
        "The booking dialog/form renders immediately when the 'Book Appointment' button is clicked — no login or identity prompt appears.",
        "The form contains exactly four fields: Patient Name, Phone Number, Service (dropdown), and Preferred Date.",
        "Submitting the form with valid data calls the backend bookAppointment function using an anonymous actor (no Internet Identity required).",
        "On successful submission, a 'Thank You' confirmation message is displayed inside the dialog.",
        "No OTP, no sign-up, no Internet Identity login step is present anywhere in the booking flow.",
        "The 'Book Appointment' CTA in the Hero section, Header, and service detail pages all open this frictionless form.",
        "Form submission is disabled and shows inline validation if Name or Phone Number is empty."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BookAppointmentDialog.tsx",
          "operation": "modify",
          "description": "Remove all authentication checks and Internet Identity dependencies from the booking dialog. Replace the existing authenticated booking flow with a fully anonymous form containing exactly four fields: Patient Name (text input), Phone Number (tel input), Service (dropdown select populated from backend via useGetAllServices), and Preferred Date (date picker). Update the useBookAppointment mutation hook call to use an anonymous actor instead of an authenticated one. On successful form submission, display an inline 'Thank You! Your appointment has been booked. We will contact you shortly.' confirmation message inside the dialog without redirecting or closing the modal. Add client-side validation to disable the submit button when Name or Phone Number is empty, showing inline validation messages. Remove any conditional rendering that gates the form behind isAuthenticated checks."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the useBookAppointment mutation hook to create and use an anonymous actor (via createActor with AnonymousIdentity) instead of requiring the authenticated actor from useActor. Ensure the mutation calls backend.bookAppointment with the four required parameters: patientName, contactInfo, preferredDate, and serviceType. Remove any authentication or identity requirements from this mutation hook so it works for unauthenticated users."
        }
      ]
    },
    {
      "id": "REQ-51",
      "summary": "Remove all authentication gates from 'Book Appointment' buttons across all public-facing pages so the frictionless booking form opens immediately for any user",
      "acceptanceCriteria": [
        "No 'Book Appointment' button on any public page shows a login prompt or requires authentication.",
        "All 'Book Appointment' / 'Book Now' buttons across HeroSection, Header, and all service detail pages open the frictionless BookAppointmentDialog directly.",
        "Unauthenticated users can open and submit the booking form without being redirected or prompted to log in."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Remove any conditional logic that gates the 'Book Appointment' button behind authentication checks. Ensure the button always renders and directly opens the BookAppointmentDialog component when clicked, regardless of user authentication status."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove any authentication gates or conditional rendering around the 'Book Appointment' button in the header navigation. Ensure the button is always visible and directly opens the BookAppointmentDialog when clicked, without checking isAuthenticated or prompting for login."
        },
        {
          "path": "frontend/src/pages/DentalImplantsDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication checks or login prompts from the 'Book Appointment' / 'Book Now' buttons on the Dental Implants detail page. Ensure all booking buttons directly open the frictionless BookAppointmentDialog without requiring user authentication."
        },
        {
          "path": "frontend/src/pages/InvisalignDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication gates from the 'Book Appointment' / 'Book Now' buttons on the Invisalign detail page. Ensure the buttons directly open the frictionless BookAppointmentDialog for all users, authenticated or not."
        },
        {
          "path": "frontend/src/pages/LaserDentistryDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication checks from the 'Book Appointment' / 'Book Now' buttons on the Laser Dentistry detail page. Ensure the booking dialog opens immediately when clicked, without requiring login or identity verification."
        },
        {
          "path": "frontend/src/pages/PediatricDentistryDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication gates from the 'Book Appointment' / 'Book Now' buttons on the Pediatric Dentistry detail page. Ensure the frictionless BookAppointmentDialog opens directly when the button is clicked, regardless of authentication status."
        },
        {
          "path": "frontend/src/pages/SmileMakeoverDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication checks from the 'Book Appointment' / 'Book Now' buttons on the Smile Makeover detail page. Ensure all booking buttons open the frictionless BookAppointmentDialog immediately without requiring user login."
        },
        {
          "path": "frontend/src/pages/ServiceDetail.tsx",
          "operation": "modify",
          "description": "Remove any authentication gates from the 'Book Appointment' / 'Book Now' buttons on the generic ServiceDetail page. Ensure the booking dialog opens directly when clicked, without checking authentication status or prompting for login."
        }
      ]
    }
  ]
}